#include <stdio.h>
#include <stdint.h>

#define VDI_FONTNAMESIZE 32

typedef struct FONT_HDR
{
/*  0 */       short font_id;
/*  2 */       short point;
/*  4 */       char name[VDI_FONTNAMESIZE];
/* 36 */       unsigned short first_ade;
/* 38 */       unsigned short last_ade;
/* 40 */       unsigned short top;
/* 42 */       unsigned short ascent;
/* 44 */       unsigned short half;
/* 46 */       unsigned short descent;
/* 48 */       unsigned short bottom;
/* 50 */       unsigned short max_char_width;
/* 52 */       unsigned short max_cell_width;
/* 54 */       unsigned short left_offset;          /* amount character slants left when skewed */
/* 56 */       unsigned short right_offset;         /* amount character slants right */
/* 58 */       unsigned short thicken;              /* number of pixels to smear when bolding */
/* 60 */       unsigned short ul_size;              /* height of the underline */
/* 62 */       unsigned short lighten;              /* mask for lightening  */
/* 64 */       unsigned short skew;                 /* mask for skewing */
/* 66 */       unsigned short flags;                /* see below */
/* 68 */       uint32_t hor_table;                  /* horizontal offsets */
/* 72 */       uint32_t off_table;                  /* character offsets  */
/* 76 */       uint32_t dat_table;                  /* character definitions (raster data) */
/* 80 */       unsigned short form_width;           /* width of raster in bytes */
/* 82 */       unsigned short form_height;          /* height of raster in lines */
/* 84 */       uint32_t next_font;                  /* pointer to next font */
/* 88 */
}  __attribute__((packed)) FONT_HDR;

#define FONTF_BIGENDIAN  0x0004            /* Font image is in byteswapped format */

static unsigned char sail_data[] = {
	0x00, 0xc5, 0x14, 0x23, 0xe6, 0x04, 0x11, 0x00, 0x00, 0x00, 0x00, 0x02, 0x30, 0x87, 0x1c, 0x13, 0xe7, 0x3e, 0x71, 0xc0, 0x00, 0x00, 0x00, 0x1c, 0x71, 0xcf, 0x1c, 0xf3, 0xef, 0x9c, 0x89, 0xc0, 0xa2, 0x82, 0x28, 0x9c, 0xf1, 0xcf, 0x1c, 0xfa, 0x28, 0xa2, 0x8a, 0x27, 0x9c, 0x81, 0xc2, 0x00, 0x20, 0x08, 0x00, 0x08, 0x03, 0x80, 0x80, 0x41, 0x10, 0x30, 0x00, 0x00, 0x00, 0x00, 0x00, 0x40, 0x00, 0x00, 0x00, 0x00, 0x0c, 0x21, 0x80, 0x00,

	0x00, 0xc5, 0x3e, 0x7b, 0x2a, 0x04, 0x20, 0x8a, 0x88, 0x00, 0x00, 0x04, 0x49, 0x88, 0xa2, 0x32, 0x08, 0x02, 0x8a, 0x22, 0x04, 0x10, 0x04, 0x22, 0x8a, 0x28, 0xa2, 0x8a, 0x08, 0x22, 0x88, 0x80, 0xa4, 0x83, 0x6c, 0xa2, 0x8a, 0x28, 0xa2, 0x22, 0x28, 0xa2, 0x52, 0x20, 0x90, 0x40, 0x47, 0x00, 0x21, 0xcb, 0x0e, 0x69, 0xc4, 0x1e, 0xb0, 0x00, 0x12, 0x13, 0x4b, 0x1c, 0xb1, 0xab, 0x1e, 0xfa, 0x28, 0xa2, 0x8a, 0x2f, 0x90, 0x20, 0x44, 0x00,
	
	0x00, 0xc5, 0x14, 0xa0, 0x44, 0x08, 0x40, 0x47, 0x08, 0x00, 0x00, 0x04, 0x58, 0x80, 0x8c, 0x53, 0xcf, 0x04, 0x72, 0x22, 0x04, 0x23, 0xe2, 0x02, 0xbb, 0xef, 0x20, 0x8b, 0xcf, 0x20, 0xf8, 0x80, 0xa8, 0x82, 0xaa, 0xa2, 0xf2, 0x2f, 0x18, 0x22, 0x28, 0xaa, 0x21, 0xc1, 0x10, 0x20, 0x4a, 0x80, 0x10, 0x2c, 0x90, 0x9a, 0x2f, 0x22, 0xc8, 0xc3, 0x14, 0x12, 0xac, 0xa2, 0xca, 0x6c, 0xa0, 0x42, 0x28, 0xa2, 0x52, 0x21, 0x10, 0x20, 0x4a, 0x80,

	0x00, 0xc0, 0x14, 0x70, 0x8a, 0x80, 0x40, 0x4d, 0xbe, 0x03, 0xe0, 0x08, 0x68, 0x87, 0x02, 0xf8, 0x28, 0x84, 0x89, 0xe0, 0x00, 0x40, 0x01, 0x0c, 0xba, 0x28, 0xa0, 0x8a, 0x08, 0x26, 0x88, 0x80, 0xb8, 0x82, 0xa9, 0xa2, 0x82, 0xaa, 0x04, 0x22, 0x25, 0x2a, 0x50, 0x82, 0x10, 0x20, 0x42, 0x00, 0x01, 0xe8, 0x90, 0x8b, 0xe4, 0x22, 0x88, 0x41, 0x18, 0x12, 0xa8, 0xa2, 0x8a, 0x28, 0x1c, 0x42, 0x25, 0x2a, 0x22, 0x22, 0x20, 0x20, 0x21, 0x00,

	0x00, 0x00, 0x3e, 0x29, 0x69, 0x00, 0x40, 0x47, 0x08, 0x20, 0x02, 0x08, 0x48, 0x88, 0x22, 0x12, 0x28, 0x88, 0x88, 0x22, 0x04, 0x23, 0xe2, 0x00, 0x82, 0x28, 0xa2, 0x8a, 0x08, 0x22, 0x88, 0x88, 0xa4, 0x82, 0x28, 0xa2, 0x82, 0x69, 0x22, 0x22, 0x25, 0x36, 0x88, 0x84, 0x10, 0x10, 0x42, 0x00, 0x02, 0x2c, 0x90, 0x9a, 0x04, 0x1c, 0x88, 0x41, 0x14, 0x12, 0xa8, 0xa2, 0xca, 0x68, 0x02, 0x42, 0x65, 0x2a, 0x51, 0xe4, 0x10, 0x20, 0x40, 0x00,

	0x00, 0xc0, 0x14, 0xf2, 0x6e, 0x80, 0x20, 0x8a, 0x88, 0x20, 0x02, 0x10, 0x31, 0xcf, 0x9c, 0x11, 0xc7, 0x08, 0x71, 0xc2, 0x04, 0x10, 0x04, 0x08, 0x72, 0x2f, 0x1c, 0xf3, 0xe8, 0x1c, 0x89, 0xc7, 0x22, 0xfa, 0x28, 0x9c, 0x81, 0xc8, 0x9c, 0x21, 0xc2, 0x22, 0x88, 0x87, 0x90, 0x08, 0x42, 0x00, 0x01, 0xab, 0x0e, 0x69, 0xc4, 0x02, 0x88, 0x41, 0x12, 0x12, 0xa8, 0x9c, 0xb1, 0xa8, 0x3c, 0x31, 0xa2, 0x14, 0x88, 0x2f, 0x90, 0x20, 0x40, 0x00,

	0x00, 0x00, 0x00, 0x20, 0x00, 0x00, 0x11, 0x00, 0x00, 0x40, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x20, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x1c, 0x01, 0xc0, 0x3e, 0x00, 0x00, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x06, 0x00, 0x00, 0x00, 0x00, 0x80, 0x20, 0x00, 0x00, 0x00, 0x00, 0x01, 0xc0, 0x0c, 0x21, 0x80, 0x00,
};


static int sail_offsets[95][2] = {
	{0, 6},								/* ' '   0x20 ascii */
	{0, 6},								/* '!'  */
	{0, 6},								/* '"'         */
	{0, 6},								/* '#'         */
	{0, 6},								/* '$'         */
	{0, 6},								/* '%'         */
	{0, 6},								/* '&'         */
	{1, 4},								/* '''         */
	{0, 6},								/* '('  0x28 ascii */
	{0, 6},								/* ')'         */
	{0, 6},								/* '*'         */
	{0, 6},								/* '+'         */
	{0, 6},								/* ','         */
	{0, 6},								/* '-'         */
	{0, 6},								/* '.'         */
	{0, 6},								/* '/'         */
	{0, 6},								/* '0'  0x30 ascii */
	{0, 6},								/* '1'         */
	{0, 6},								/* '2'         */
	{0, 6},								/* '3'         */
	{0, 6},								/* '4'         */
	{0, 6},								/* '5'         */
	{0, 6},								/* '6'         */
	{0, 6},								/* '7'         */
	{0, 6},								/* '8'  0x38 ascii */
	{0, 6},								/* '9'         */
	{0, 6},								/* ':'         */
	{0, 6},								/* ';'         */
	{0, 6},								/* '<'         */
	{0, 6},								/* '='         */
	{0, 6},								/* '>'         */
	{0, 6},								/* '?'         */
	{0, 6},								/* '@'  0x40 ascii */
	{0, 6},								/* 'A'         */
	{0, 6},								/* 'B'         */ 
	{0, 6},								/* 'C'         */ 
	{0, 6},								/* 'D'         */ 
	{0, 6},								/* 'E'         */ 
	{0, 6},								/* 'F'         */ 
	{0, 6},								/* 'G'         */ 
	{0, 6},								/* 'H' 0x48 ascii */
	{0, 5},								/* 'I'         */ 
	{0, 6},								/* 'J'         */ 
	{0, 6},								/* 'K'         */ 
	{0, 6},								/* 'L'         */ 
	{0, 6},								/* 'M'         */ 
	{0, 6},								/* 'N'         */ 
	{0, 6},								/* 'O'         */ 
	{0, 6},								/* 'P' 0x50 ascii */
	{0, 6},								/* 'Q'         */ 
	{0, 6},								/* 'R'         */ 
	{0, 6},								/* 'S'         */ 
	{0, 6},								/* 'T'         */ 
	{0, 6},								/* 'U'         */ 
	{0, 6},								/* 'V'         */ 
	{0, 6},								/* 'Q'         */ 
	{0, 6},								/* 'X' 0x58 ascii */
	{0, 6},								/* 'Y'         */ 
	{1, 5},								/* 'Z'         */ 
	{0, 6},								/* '['         */ 
	{0, 6},								/* '\'         */ 
	{0, 6},								/* ']'         */ 
	{0, 6},								/* '^'         */ 
	{0, 6},								/* '_'         */ 
	{0, 6},								/* '`' 0x60 ascii */
	{0, 6},								/* 'a'         */
	{0, 6},								/* 'b'         */
	{1, 5},								/* 'c'         */
	{0, 6},								/* 'd'         */
	{0, 6},								/* 'e'         */
	{0, 6},								/* 'f'         */
	{0, 6},								/* 'g'         */
	{0, 6},								/* 'h' 0x68 ascii */
	{2, 3},								/* 'i'         */
	{1, 4},								/* 'j'         */
	{0, 6},								/* 'k'         */
	{1, 5},								/* 'l'         */
	{0, 6},								/* 'm'         */
	{0, 6},								/* 'n'         */
	{0, 6},								/* 'o'         */
	{0, 6},								/* 'p' 0x70 ascii */
	{0, 6},								/* 'q'         */
	{0, 6},								/* 'r'         */
	{0, 6},								/* 's'         */
	{0, 6},								/* 't'         */
	{0, 6},								/* 'u'         */
	{0, 6},								/* 'v'         */
	{0, 6},								/* 'w'         */
	{0, 6},								/* 'x' 0x78 ascii */
	{0, 6},								/* 'y'         */
	{0, 6},								/* 'z'         */
	{0, 6},								/* '{'         */
	{0, 6},								/* '|'         */
	{0, 6},								/* '}'         */
	{0, 6},								/* '~' 0x7e ascii */
};

FONT_HDR hdr = {
		99,
		8,
		"sail",
		32,
		126,
		4,
		4,
		3,
		1,
		1,
		6,
		6,
		0,
		0,
		1,
		1,
		0x5555,
		0xaaaa,
		0,
		88,
		88,
		88 + 96 * 2,
		72,
		7,
		0
};

unsigned short offsets[96] = {
	0,
	6,
	12,
	18,
	24,
	30,
	36,
	42,
	48,
	54,
	60,
	66,
	72,
	78,
	84,
	90,
	96,
	102,
	108,
	114,
	120,
	126,
	132,
	138,
	144,
	150,
	156,
	162,
	168,
	174,
	180,
	186,
	192,
	198,
	204,
	210,
	216,
	222,
	228,
	234,
	240,
	246,
	252,
	258,
	264,
	270,
	276,
	282,
	288,
	294,
	300,
	306,
	312,
	318,
	324,
	330,
	336,
	342,
	348,
	354,
	360,
	366,
	372,
	378,
	384,
	390,
	396,
	402,
	408,
	414,
	420,
	426,
	432,
	438,
	444,
	450,
	456,
	462,
	468,
	474,
	480,
	486,
	492,
	498,
	504,
	510,
	516,
	522,
	528,
	534,
	540,
	546,
	552,
	558,
	564,
	570
};

int main(void)
{
	const char *filename = "sail.fnt";
	FILE *fp;
	
	fp = fopen(filename, "wb");
	fwrite(&hdr, 1, sizeof(hdr), fp);
	fwrite(offsets, 1, sizeof(offsets), fp);
	fwrite(sail_data, 1, sizeof(sail_data), fp);
	fclose(fp);
	return 0;
}
